shared_with_qemu/pi_fio_results/noiomap_com_4G_mem_write_bs-128k_20250815-070338.log
buffered-write: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=4306: Fri Aug 15 07:03:39 2025
  write: IOPS=12.2k, BW=1519MiB/s (1593MB/s)(512MiB/337msec); 0 zone resets
    clat (usec): min=33, max=276, avg=80.76, stdev= 7.39
     lat (usec): min=34, max=277, avg=81.60, stdev= 7.40
    clat percentiles (usec):
     |  1.00th=[   62],  5.00th=[   74], 10.00th=[   76], 20.00th=[   78],
     | 30.00th=[   79], 40.00th=[   80], 50.00th=[   81], 60.00th=[   82],
     | 70.00th=[   83], 80.00th=[   85], 90.00th=[   87], 95.00th=[   89],
     | 99.00th=[  103], 99.50th=[  110], 99.90th=[  133], 99.95th=[  172],
     | 99.99th=[  277]
  lat (usec)   : 50=0.22%, 100=98.24%, 250=1.51%, 500=0.02%
  cpu          : usr=0.89%, sys=98.21%, ctx=2, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4096,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1519MiB/s (1593MB/s), 1519MiB/s-1519MiB/s (1593MB/s-1593MB/s), io=512MiB (537MB), run=337-337msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%