shared_with_qemu/pi_fio_results/noiomap_com_4G_mem_write_bs-4k_20250815-070323.log
buffered-write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=4090: Fri Aug 15 07:03:24 2025
  write: IOPS=161k, BW=627MiB/s (658MB/s)(512MiB/816msec); 0 zone resets
    clat (usec): min=3, max=439, avg= 5.84, stdev= 1.66
     lat (usec): min=3, max=439, avg= 5.91, stdev= 1.66
    clat percentiles (nsec):
     |  1.00th=[ 4896],  5.00th=[ 5152], 10.00th=[ 5280], 20.00th=[ 5472],
     | 30.00th=[ 5600], 40.00th=[ 5728], 50.00th=[ 5856], 60.00th=[ 5984],
     | 70.00th=[ 6048], 80.00th=[ 6176], 90.00th=[ 6304], 95.00th=[ 6368],
     | 99.00th=[ 6816], 99.50th=[ 7008], 99.90th=[11328], 99.95th=[13376],
     | 99.99th=[26240]
   bw (  KiB/s): min=652216, max=652216, per=100.00%, avg=652216.00, stdev= 0.00, samples=1
   iops        : min=163054, max=163054, avg=163054.00, stdev= 0.00, samples=1
  lat (usec)   : 4=0.01%, 10=99.86%, 20=0.12%, 50=0.01%, 100=0.01%
  lat (usec)   : 500=0.01%
  cpu          : usr=10.67%, sys=88.96%, ctx=12, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=627MiB/s (658MB/s), 627MiB/s-627MiB/s (658MB/s-658MB/s), io=512MiB (537MB), run=816-816msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%